#### Name: Pranav Mehendale
#### Roll No.: TCOD34
#### Batch: T11

# Assignment 1 Group A

### Data Wrangling. I

Perform the following operations using Python on any open source dataset (e.g., data.csv)

1. Import all the required Python Libraries

2. Locate an open source data from the web (e.g. https://www.kaggle.com). Provide a clear description of the data and its source (i.e.. URL. of the web site)

3. Load the Dataset into pandas data frame

4. Data Preprocessing check for missing values in the data using pandas isnull(), describe() function to get some initial statistres. Provide variable descriptions. Types of variables etc. Check the dimensions of the data frame

5. Data Formatting and Data Normalization: Summarize the types of variables by checking the data types (ie, character, numeric, integer, factor, and logical) of the variables in the data set. If variables are not in the correct data type, apply proper type conversions.

6. Turn categorical variables into quantitative variables in Python In addition to the codes and outputs, explain every operation that you do in the above steps and explain everything that you do to import/read/scrape the data set

### Detail Description:

The Titanic dataset offers a comprehensive glimpse into the passengers aboard the ill-fated RMS Titanic, which famously sank on its maiden voyage in April 1912 after colliding with an iceberg. This dataset contains a wealth of information about individual passengers, including demographics, ticket class, cabin information, family relationships, fare details, and most notably, survival outcomes.

Key attributes within the dataset include:

Passenger Class (Pclass): This categorical variable indicates the ticket class of each passenger, ranging from 1st class (wealthiest) to 3rd class (lower socioeconomic status).

Name: The names of passengers, providing insight into their identities.

Sex: Gender of passengers, categorized as male or female.

Age: Age of passengers, providing information about the demographic composition of the Titanic's passengers.

SibSp: Number of siblings/spouses aboard the Titanic, offering insight into family relationships.

Parch: Number of parents/children aboard the Titanic, indicating family size and composition.

Ticket: Ticket number, providing additional information about passenger accommodations and fare details.

Fare: Fare paid by each passenger, which can be indicative of their ticket class and economic status.

Cabin: Cabin number or location, offering insights into passenger accommodations.

Embarked: Port of embarkation (C = Cherbourg, Q = Queenstown, S = Southampton), providing information about passengers' embarkation points.

Survived: This binary variable indicates whether a passenger survived the disaster (1) or not (0), serving as the primary outcome variable for analyses.

Researchers and data analysts frequently utilize the Titanic dataset for various purposes, including:

Exploratory data analysis to understand the demographic composition of passengers and their survival outcomes.
Predictive modeling to develop algorithms that predict the likelihood of survival based on passenger characteristics.
Feature engineering to derive new variables that may enhance predictive accuracy.
Hypothesis testing to investigate factors associated with survival rates, such as passenger class, gender, age, and family size.
Overall, the Titanic dataset serves as a valuable resource for understanding historical events, exploring data analysis techniques, and teaching machine learning concepts. Its accessibility and rich contextual information make it a popular choice for both educational and research purposes within the data science community.

### Importing neccessary modules

In [1]:
import pandas as pd
import numpy as np

### Loading dataset and analysing its properties

In [2]:
df = pd.read_csv('./train.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Checking Null Values in the data

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

The non-zero value above indicates that there are few people with same ticket numbers.

This is the frequncy in which duplicate tickets occur ini the dataset.

### Handling Missing Values

#### We will simply remove rows with null at Embarked as they are very less.

In [6]:
df.dropna(subset=['Embarked'],inplace=True)
df.shape

(889, 12)

We can clearly see that 2 rows are dropped from the data.

#### For filling the null values in the age colummns we'll be filling random value between 25 to 75 if SibSp >0 or 0-24 if SibSp=0

In [7]:
def fill_age(age, sibsp):
    if pd.isna(age):  # Check for NaN only
        if sibsp > 0:
            return np.random.randint(25, 76)
        else:
            return np.random.randint(0, 25)
    else:
        return age

df['Age'] = df.apply(lambda row: fill_age(row['Age'], row['SibSp']), axis=1)
df['Age'].isna().sum()

0

We replaced all the null values in the Age column

In [8]:
df['Cabin'].isna().sum()/889*100

77.27784026996626

#### Cabin has over 75% missing values so we'll drop the column

In [9]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [10]:
df.dropna(axis=1,inplace=True)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

### Variable data type checking

In [11]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

All columns have correct data types

### Categorical Variable Encoding

In [12]:
df['Sex'].value_counts()

Sex
male      577
female    312
Name: count, dtype: int64

As sex column has only 2 values we'll map them with 0 or 1

In [13]:
new = df.copy()
new['Sex'] = new['Sex'].map({'male':0, 'female':1})

For Embarked column we'll use LabelEncoder() to categorically encode the column

In [14]:
from sklearn.preprocessing import LabelEncoder

In [15]:
le = LabelEncoder()
new['Embarked'] = le.fit_transform(df['Embarked'])
new.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,0
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,2
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,2

In [16]:
new.describe()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
count,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000
mean,446.000000,0.382452,2.311586,0.350956,27.964196,0.524184,0.382452,32.096681,1.535433
std,256.998173,0.486260,0.834700,0.477538,16.362787,1.103705,0.806761,49.697504,0.792088
min,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,224.000000,0.000000,2.000000,0.000000,18.000000,0.000000,0.000000,7.895800,1.000000
50%,446.000000,0.000000,3.000000,0.000000,26.000000,0.000000,0.000000,14.454200,2.000000
75%,668.000000,1.000000,3.000000,1.000000,37.000000,1.000000,0.000000,31.000000,2.000000
max,891.000000,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200,2.000000

In [17]:
new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 889 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    int64
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Embarked     889 non-null    int32
dtypes: float64(2), int32(1), int64(6), object(2)
memory usage: 79.9+ KB